[
  {
    "name": "Black Start",
    "category": "Drama",
    "url": "https://www.amazon.com/Audible-Black-Start/dp/B0C9W8ZTQ5",
    "about": "When an unprecedented cold front settled in over the state of Texas in the late winter of 2021, demand for electricity soared just while much of the power supply was disabled by the unrelenting deep-freeze conditions. Four million people were without power for weeks, and 150 people lost their lives. It could have been much, much worse.\n\nA power plant needs electricity to operate. If any plant were to shut down completely and be isolated from the grid, it will need an external source to restart, a complex procedure called “Black Start”.\n\nBlack Start is a novel that weaves the story of a highly competent Russian agent, Ivan Stravinsky, who has devised a scheme to replicate the conditions that attended the 2021 debacle in Texas, and then to disable the few unreliable and poorly maintained Black Start units scattered throughout the state. One small, independent-minded utility in West Texas is standing in his way as Stravinsky sets out to disrupt the entire economy of Texas.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/black-start.webp?alt=media&token=e76e3939-2774-410a-bf2e-ee7c7ba7d999"
  },
  {
    "name": "Trios: Death, Deceit, and Politics",
    "category": "Drama",
    "url": "https://www.amazon.com/Trios-Death-Deceit-and-Politics/dp/B0C5S6HNQD",
    "about": "Rita Collins, a reporter and writer for a local Washington DC television station, faces apparently unexplained rejection by her husband, who has suffered amputation of both legs during the Iraq War. He refuses both her affection and any attempts at rehabilitation.\n\nAt the same time, Rita is investigating a radical political cell on an elite college campus. With the help of her husband’s psychiatrist, she discovers that her marriage was doomed from the start because of its intricate ties to the career of her politically corrupt father-in-law, a Pennsylvania state senator, and his manipulative political advisor.\n\nOnce her initial grief gives way to anger, Rita uses her contacts within the news media to exact revenge on her father-in-law. On the same night she successfully covers a major campus riot, the revenge she fashions proves more destructive than she could have imagined.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/trios.webp?alt=media&token=e22651f3-9692-46c9-92eb-160c1908d91f"
  }
]