[
  {
    "name": "Coming Up Short",
    "category": "Horror",
    "url": "https://www.amazon.com/Coming-Up-Short-Psychological-Horror/dp/B0CNDZT34S",
    "about": "A husband and wife find themselves repeating the same scene over and over\nas something large looms in the sky above them.\n \nAn old woman who takes \ncare of her Alzheimer’s inflicted husband is exasperated when she realizes\nhe believes that his mother is at their front door. Her mother-in-law, who \nhas been dead for many years. She wants to show him he’s wrong, however, opening \nthe door to prove it to him is a bad idea. Something is waiting for them, lurking \nin the fog beyond the safety of their home\nTwo teenage boys spend a Saturday\ntogether, but a practical joke they play gets out of hand. When they seriously \ninjure a girl from their school, going on the run seems the only way out of\ntrouble. Entering a door inside a deserted department store moves them a million \nmiles from home with someone who has revenge on her mind\nComing Up Short is a \ncollection of 10 tales of the macabre by the author of the award winning Within the '\n'Fog series. \nWarning: These stories will keep you awake, nervously chewing at your fingernails, '\ncringing at every little creak of your home. Our reality may not be what you have been\nled to believe",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/cus1.webp?alt=media&token=b96ed43f-5d07-4825-a388-a618e5c83fc5"
  },
  {
    "name": "Coming Up Short 2",
    "category": "Horror",
    "url": "https://www.amazon.com/Coming-Up-Short-Psychological-Horror/dp/B0CNSCMF9R",
    "about": "A young boy has friends over to spend the night, but he is warned that he cannot allow\nthe tragedies of the past to repeat themselves. \nA man struggling with sin returns to his cabin in the woods to face his demons and is instead confronted\nby his dead wife.\nThe Antique Emporium is a store that appears out of nowhere to offer the finest of yesterday’s household \ngoods. It is run by a man as intent on selling his wares as he is devoted to filling the personal needs\nof his customers. But every antiquity comes with a warning. Sometimes the troubles we send away, stay away, \nand sometimes they return worse than they ever were. \nComing Up Short 2 is a collection of 8 tales of the macabre by the author of the award winning \nWithin the Fog series.\nWarning: These stories will keep you awake, nervously chewing at your fingernails, cringing at every little\ncreak of your home. Our reality is not what we have been led to believe. There are things out there, \nin the shadows watching, waiting for us to come within reach, and they are hungry.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/cus2.webp?alt=media&token=c8db7844-e086-4cf5-b756-aca4c01dfb7f"
  },
  {
    "name": "Coming Up Short 3",
    "category": "Horror",
    "url": "https://www.amazon.com/Audible-Coming-Up-Short-3/dp/B0CP8HZLM8",
    "about": "A man finds his happiest life in the world inside his coma. He also finds that the difference between heaven and hell can be a very thin line.\nA man wakes on a cold basement floor staring at two women who are bound to their chairs. Across the room, a dead man lies in a pool of blood. He cannot recall who they are or even his own name. The women beg the man to free them, but something seems wrong. Maybe it is he who needs to be freed.\nOn a houseboat in the middle of a large lake, a retired couple experience a brief, strange flash of light. The next day, something tracks them from their boat to a nearby small town through the forest. What they find in the town is more horrifying than what awaits them on their return to the boat.\nComing Up Short 3 is a new collection of tales of the macabre by the author of the award winning Within the Fog series.\nWarning: These stories will keep you up late at night, nervously chewing your fingernails, cringing at every little creak of your home. Our reality may not be what you have been led to believe.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/cus3.webp?alt=media&token=67b61162-b643-462b-97f9-a45a2520a3f0"
  },
  {
    "name": "Coming Up Short 4",
    "category": "Horror",
    "url": "https://www.amazon.com/Coming-Up-Short-Psychological-Horror/dp/B0CQ69QCB4",
    "about": "A man finds himself the subject of interrogation related to a break in at his home. Or does he? The line between reality and insanity is easily blurred and razor thin for Marv Stillman.\nTwo best friends join one another on yet another adventure, this time to the furthest remote corner of the Rocky Mountains. They seek evidence of an ever-elusive beast. What they don’t know is that sometimes the thing you should fear isn’t what hides in the woods, but the thing that’s been right in front of you all along.\nIn an elevator, a young woman and man find themselves stuck between floors with an old man who is anything but helpful. As their time in the unmoving car lengthens, there are signs that there is much more on the line than escaping their confinement. Who is the old man who seems to know far more about them than he should?\nComing Up Short 4 is a new collection of tales of the macabre by the author of the award winning Within the Fog and Killer of Killers series.\nWarning: These stories will keep you up late at night, nervously chewing your fingernails, cringing at every little creak of your home. Our reality may not be what you have been led to believe.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/cus4.webp?alt=media&token=c7af9b99-c0d7-492b-8e93-d4e45c88bd18"
  },
  {
    "name": "Coming Up Short 5",
    "category": "Horror",
    "url": "https://www.amazon.com/Coming-Up-Short-Psychological-Horror/dp/B0CSPQD8L2",
    "about": "A man wakes locked in a cage, in a very dark place. One by one, the ghosts of his family appear to him. They share a message of healing, but not all is what it seems.\nA hitman is paid to eliminate the CEO of a powerful company, but when he makes a big bet with a local bookie, he realizes there’s much more to his current job than he ever knew. Can he survive the secrets he uncovers after seeing the man he killed alive and well?\nThe dead should stay dead. There’s a very good reason not to play God – when the dead return, they’re never the same. Jed knows this before he ever tries to bring back the love of his life, but he cannot stop himself. The absence of his love is more than he can bear and what comes back to him is more than he can handle.\nComing Up Short 5 is a new collection of tales of the macabre by the author of the award winning Within the Fog and Killer of Killers series.\nWarning: These stories will keep you up late at night, nervously chewing your fingernails, cringing at every little creak of your home. Our reality may not be what you have been led to believe. The truth of our existence can be found in the shadows and dark corners of our world. These are the places we Come Up Short.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/cus5.webp?alt=media&token=1afd2e1d-d61a-4917-8eec-124714347409"
  },
  {
    "name": "Coming Up Short 6",
    "category": "Horror",
    "url": "https://www.amazon.com/Coming-Up-Short-Twisted-Tales/dp/B0CVLXR3P9",
    "about": "A woman desperately wants to escape the life she leads with her husband but discovers a reason to stay with him. The secrets he divulges while sleeping are making her wealthy, or so she thinks.\nA man fresh out of a divorce discovers that he may have purchased a haunted house. He feels he’s slowly losing his mind until he discovers a secret. The secret might just pave a way back to his wife, or it may kill him.\nOn a summer mountainside two former friends reconnect for a camping trip. All is well until a stranger arrives at their campsite in the middle of the night. For one of the women campers, the man who arrives isn’t so unfamiliar after all.\nComing Up Short 6 is a new collection of tales of the macabre and the mysterious by the author of the award winning Within the Fog series.\nWarning: These stories will keep you up late at night, nervously chewing your fingernails, cringing at every little creak of your home. Our reality may not be what you have been led to believe.\nFor fans of The Twilight Zone, the Coming Up Short series will be familiar, and intense territory!",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/cus6.webp?alt=media&token=19bba213-9444-4c61-b76f-8f79bc7b69fa"
  },
  {
    "name": "Coming Up Short 7",
    "category": "Horror",
    "url": "https://www.amazon.com/Coming-Up-Short-Psychological-Horror/dp/B0CWPS7R76",
    "about": "A family moves into a scenic mountain town to start over. It is their intent to leave behind the violence and turmoil of their past. They find the perfect house situated on a large lake in the center of the town to begin the process of healing, but something is off. Lake Reflection is different. The negative energy and emotion they send out affects the large body of water and the townspeople are watching them very closely.\nA young couple pulls into a convenience store for gas and a few items. Inside the store, they meet some old acquaintances and a stranger. As the dark skies turn into a dangerous storm, someone plays a deadly game of manipulation. While they shelter from the storm, the stranger exposes their secrets, and the consequences are explosive.\nOn a summer evening a woman leaves home to run to the store. There, she sees a woman seeking help from the backseat of a car. Realizing the woman has been kidnapped, and that she had no phone to call the police, the woman follows the car into the open spaces of the country. Ultimately, she arrives at a remote house. It is there that she realizes she’s made the biggest mistake of her life and that there may be no way back home.\nComing Up Short 7 is a new collection of tales of the macabre and the mysterious by the author of the award winning Within the Fog series.\nWarning: These stories will keep you up late at night, nervously chewing your fingernails, cringing at every little creak of your home. Our reality may not be what you have been led to believe.\nFor fans of The Twilight Zone, the Coming Up Short series will be familiar, and intense territory!",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/cus7.webp?alt=media&token=27cc557c-891d-416b-ac12-561719622d90"
  },
  {
    "name": "Coming Up Short 8",
    "category": "Horror",
    "url": "https://www.amazon.com/Coming-Up-Short-Psychological-Horror-ebook/dp/B0CVXSVDFF",
    "about": "A young man knows he needs to escape the desperate financial clinging of his alcoholic mother. It’s well past time for him to have a life of his own, settle down with his girlfriend, and look to the future. He wants those things, but…something is wrong. He has forgotten something very important and needs to remember. The night the black classic Chevy shows up in the drive-thru at his work, it all comes crashing down on him, and suddenly, his future may not be what he hoped, not even close.\nWhen a young man sits at his bedroom window, staring into the death and destruction his neighborhood has become, he isn’t remorseful over all that’s been lost. Instead, he celebrates it, for the lawlessness that has overtaken the world has freed his creative, evil impulses. He’s a killer looking for one more death…or is he? There’s something about Michael that isn’t what it seems, not yet anyway.\nBeing allowed to make three wishes, and have anything she wants, isn’t appealing to Delia Martinez because she believes the old man who has offered such an opportunity to her is a fraud. When she realizes she was wrong, and that she is now encountering the opposite of her wishes she’ll move heaven and earth to get her three wishes back, but can she afford the price that will be asked of her? Sometimes making a deal isn’t just a deal when it comes to the devil.\nComing Up Short 8 is a new collection of tales of the macabre and the mysterious by the author of the award-winning Within the Fog series.\nWarning: These stories will keep you up late at night, nervously chewing your fingernails, cringing at every little creak of your home. Our reality may not be what you have been led to believe.\nFor fans of The Twilight Zone, the Coming Up Short series will be familiar, and twisted territory!",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/cus8.webp?alt=media&token=469183ec-bfe0-4f5d-9b38-a8022300e874"
  },
  {
    "name": "Wicked Games",
    "category": "Horror",
    "url": "https://www.amazon.com/Audible-Wicked-Games/dp/B0CZSGT6B8",
    "about": "Being supremely wealthy is not all it’s cracked up to be…\nOnce you have every single possession your heart desires, once you have no room in any of your garages for yet another super car, and you do not need another mansion in another exclusive neighborhood…\nOnce your money has corrupted your sense of morality…\nWhen wealth can no longer keep your evil heart content…\nWhat do you do for fun?\nWhat do the rich do to entertain themselves?\nThe Club.\nThe elite, the wealthiest of the rich, have an ultra-exclusive club. The Club affords its members a reprieve from the mundane, from boredom. It offers them entertainment through the elimination of an enemy, or anyone else that their hearts desire.\nSomeone in The Club desires to eliminate Gianna Ricci. Someone wants her dead.\nBut who? And why?\nGianna will soon find out what the elite, the superbly wealthy do for entertainment.\nGianna will find out that those around her are not always who they seem to be.\nGianna will come to know what the elite do for fun…\nThey play Wicked Games.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/wickedGames.webp?alt=media&token=c3fb6861-2ea4-4e8c-8332-7e729713bce0"
  }
]