[
  {
    "name": "How to Sell Like a Drug Dealer: 21 Strategies to Hook Customers and Boost Sales: This Book Isn't About Selling Drugs!",
    "category": "info",
    "url": "https://www.amazon.com/How-Sell-Like-Artist-Customers/dp/B0CT42BDWT",
    "about": "In How to Sell Like a Drug Dealer, step into the intriguing world of underground transactions and discover 21 captivating strategies that will transform your sales approach. Inspired by stories and insights from the shadows, this book offers a fresh perspective on effective selling techniques that can be adapted to the legitimate business world.\n\nUncover the secrets of successful drug dealers who mastered the art of persuasion, customer loyalty, and maximizing profits. Each strategy, crafted with wit and practicality, will empower you to build strong customer relationships, craft irresistible pitches, create scarcity, harness social proof, and more.\n\nThrough thought-provoking anecdotes and actionable advice, this book challenges conventional sales approaches and introduces innovative methods to captivate your audience. Dive into the world of The Hook Line, The Addiction Loop, The Fear Factor, and other intriguing strategies, all designed to hook customers and boost your sales game.\n\nWhile the stories presented in this book use fictitious names and draw inspiration from the underground realm, the underlying principles are universally applicable to any industry. Ethical selling, strong communication skills, and an understanding of customer psychology are at the core of each strategy.\n\nBy embracing the unconventional wisdom shared within these pages, you'll become a more persuasive, influential, and successful salesperson. Stand out in the competitive marketplace, build lasting customer loyalty, and achieve remarkable results.\n\nWhether you're a seasoned sales professional looking to enhance your skills or an aspiring entrepreneur seeking fresh insights, \nHow to Sell Like a Drug Dealer\n offers a unique and engaging roadmap to sales success. Take the leap and discover how these unconventional strategies can transform your sales approach, leaving a lasting impact on your career.\n\nScroll up, click the Buy Now\n\n button, and embark on a thrilling journey to master the art of selling like a drug dealer!",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/How%20to%20Drug.webp?alt=media&token=80f0ab65-23b1-4492-ad12-27db3b12c10d"
  },
  {
    "name": "How to Sell Like a Con Artist: 26 Tricks to Persuade Customers and Win People Over",
    "category": "info",
    "url": "https://www.amazon.com/How-Sell-Like-Artist-Customers/dp/B0CT42BDWT",
    "about": "In How to Sell Like a Con Artist,\n\n Shaun Graff takes you on an intriguing journey into the world of persuasion, as seen through the eyes of the most unlikely teachers: con artists. This book is not a guide to deceit, but rather a unique exploration of the art of influence, distilled from the cunning tactics of con artists. Graff masterfully uncovers the psychological strategies used in cons and transforms them into ethical tools for effective selling, leadership, and everyday interactions.\n\nWhy learn from con artists? They are, after all, the masters of persuasion. Each chapter in this book reveals a different aspect of their craft, from creating unshakable belief to the art of storytelling, all translated into practical, ethical strategies for genuine influence. Whether you’re in sales, marketing, or simply aiming to improve your persuasive skills, this book offers invaluable insights.\n\nGraff’s approach is both practical and insightful, blending psychological theory with real-world applications. He turns the shadowy techniques of con artists into legitimate strategies for effective communication and influence, all while maintaining a strong ethical compass.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/How%20to%20Sell%20Like%20a%20Con%20Artist.webp?alt=media&token=344d0ec3-e52c-4a58-8883-754def69749d"
  },
  {
    "name": "The 7 Habits of Highly Arrogant People: Trump Edition",
    "category": "info",
    "url": "https://www.amazon.com/Habits-Highly-Arrogant-People-Trump/dp/B0C87ZD5FX",
    "about": "Introducing \"The Seven Habits of Highly Arrogant People: Trump Edition\" - the hilarious and thought-provoking parody guide that takes the art of arrogance to a whole new level.\n\nIn this Trump-inspired edition, you'll journey through the habits that defined one of the world's most polarizing figures. From Trump's unapologetic self-centeredness to his disdain for criticism, this book will have you chuckling, cringing, and questioning your own behavior.\n\nBut don't be mistaken; this book is not just a laugh-out-loud parody. It's a wake-up call to examine our own actions and break free from the clutches of arrogance. Through clever anecdotes and intellectual insights, you'll understand the dangers of unchecked self-importance and discover how to cultivate humility, empathy, and self-awareness.\n\nWhether you're seeking to improve your relationships, excel in your career, or grow as an individual, \"The Seven Habits of Highly Arrogant People: Trump Edition\" provides the indispensable tools and insights you need to shed the shackles of arrogance and embrace a more authentic and fulfilling life.\n\nSo, if you're ready to laugh, learn, and reflect on your behavior (and maybe even indulge in a little guilty pleasure), grab a copy of \"The Seven Habits of Highly Arrogant People: Trump Edition\" today. It's the perfect read for anyone who has encountered an arrogant person (or perhaps caught a glimpse of their reflection in the mirror).\n",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/trump.webp?alt=media&token=34a95122-b23d-42a3-bea5-8a59e23f7334"
  },
  {
    "name": "Land of the Free Home of the Nationalists: The Rise of Christian Nationalism",
    "category": "info",
    "url": "https://www.amazon.com/Land-Free-Home-Nationalists-Nationalism/dp/B0CSHGQTQQ",
    "about": "In this short treatise, historian Keith Pruitt examines the idea of the United States as a Christian Nation. First, examining the intent of the founding fathers and then their religious beliefs, Pruitt shows that the founders wanted to guarantee religious freedom while refusing to impose a state religion. The current movement of Christian Nationalism is further examined to attempt to determine what it is that these right-wing religious zealots are trying to achieve in this nation.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/Audio%20Cover%20Land%20of%20the%20Free.jpg?alt=media&token=8e65f793-74ca-451e-a708-43c3665e1c95"
  },
  {
    "name": "The Ultimate Siberian Husky Training Guide: The Definitive Guide to Finding, Preparing For, Training, Exercising, Feeding, All the Facts You Need to Know to Give Your Furry Friend the Best Start",
    "category": "info",
    "url": "https://www.amazon.com/Ultimate-Siberian-Husky-Training-Guide/dp/B0BTZB4D1X",
    "about": "A revolutionary and comprehensive guide to everything pertaining to the Siberian Husky. This is a must-listen for any current or prospective Husky owner. Written by experienced Husky owner Mary Meisenzahl, this audiobook provides vital information on how best to live with, raise, and train a Siberian Husky.\n\nThis audiobook provides valuable knowledge on the origins of the Siberian Husky, as well as their unique personality traits that make them so popular with owners around the world. She also explores common behavioral issues associated with this type of canine companion, and ways in which owners can learn to manage these behaviors appropriately. With chapters dedicated to understanding common breeds associated with Siberian Huskies–including Alaskan Malamutes– listeners will gain an invaluable resource when it comes to making informed decisions about their pet's lifestyle needs.\n\nOverall, The Ultimate Siberian Husky Training Guide is truly indispensable for any current or aspiring husky parent looking for an all-encompassing resource outlining everything from practical advice on day-to-day care through to detailed descriptions of canine competitions available around the world. This audiobook is sure to provide invaluable insight into creating long lasting bonds between huskies and their owners!\n\nIn this audiobook, you'll will:\n\nLearn all about the unique characteristics and quirks of the Siberian Husky breed, such as their intelligence, energy levels, and vocalization habits.\nGet in-depth advice on early training strategies for your Husky puppy, including containment methods such as crate training and housebreaking.\nDiscover the best supplies and food to provide for your new pup, taking into account dietary restrictions, growth potential, and other health concerns.\nUnderstand helpful strategies for socializing your Husky with other dogs in order to maximize their interaction potential and reduce behavioral problems.\nInvestigate health care advice that you need to know for your Siberian Husky at every stage of their life, from puppyhood to adulthood.\nLearn helpful grooming tips that every Husky owner should be aware of in order to keep their pup looking their best! With this informative audiobook by your side, you will be able to provide the best care possible for your Husky throughout its entire life cycle.\nThis audiobook is the perfect guide for anyone looking to bring a Siberian Husky into their life. It will give you all the tips and tricks for raising a healthy and happy Husky, from finding the right breeder or rescue to choosing a vet and potty training. You'll get step-by-step advice to help you form a strong bond and lasting relationship with your new pup.\n\nWe'll provide answers to important questions like:\n\nIs a Siberian Husky really the right breed of dog for me?\nShould I purchase my Husky pup from a breeder, or look into adopting one from an animal rescue?\nWhat are some of the most common mistakes I should be aware of when bringing home my new puppy?\nWhat's the best way to properly train my Husky with positive reinforcement methods?\nYou'll also learn about topics such as nutrition, grooming needs, health concerns, exercise requirements, and other activities that will enrich your pup's life. We'll provide information on where you can find reputable breeders and rescues so you can find your perfect pooch quickly and easily. Plus, we'll even discuss more advanced topics like crate training your pup, teaching basic obedience commands, introducing them to other animals in the household, getting them used to being handled by strangers, socialization during puppyhood, and more!",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/husky.webp?alt=media&token=1adebcc0-6247-4e88-9cf3-018d0f8e671c"
  },
  {
    "name": "THE RED SEA and the PARTING: Exploring the Scientific Evidence of A Miracle",
    "category": "info",
    "url": "https://www.amazon.com/Red-Sea-Parting-Exploring-Scientific/dp/B0BX12V8YZ",
    "about": "More than 3,000 years ago, an event so miraculous and awe-inspiring occurred, that it still intrigues believers, historians, and mythicists. The parting of the Red Sea is an epic scene in movies and the cover illustration on many Bibles.\n\nThis book endeavors to examine the various theories about the parting of the Red Sea to determine the correct location, the time period, and the historicity of the events from a biblical and scientific point of view.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/redsea.webp?alt=media&token=bac36c32-1b85-4f53-8766-5d01f594474f"
  },
  {
    "name": "The Complete Guide to Financial Planning: Learn How to Manage Your Money and Build Wealth for a Secure Future",
    "category": "info",
    "url": "https://www.amazon.com/Complete-Guide-Financial-Planning-Manage/dp/B0C3NPJGMW",
    "about": "Are you struggling to manage your money and achieve your financial goals? Do you want to learn how to build long-term wealth and achieve financial stability? Look no further than The Complete Guide to Financial Planning.\n\nThis comprehensive guide to personal finance covers everything from budgeting and debt management to investing and retirement planning. With practical tips and strategies for improving your financial situation, you'll learn how to make informed decisions about your money and achieve your financial goals.\n\nInside, you'll find:\n\nClear explanations of financial planning principles and strategies\nActionable tips for developing a financial plan and sticking to a budget\nStrategies for managing debt and improving your credit score\nInsight into different types of investments and retirement planning options\nGuidance on insurance, taxes, and real estate investing\nTips for financial planning for major life events, such as marriage and having children\nAnd much more!\nWritten in an accessible and easy-to-understand style, The Complete Guide to Financial Planning is perfect for anyone looking to improve their financial literacy and take control of their finances. Whether you're just starting out or looking to build wealth over time, this guide has everything you need to succeed.\n\nInvest in your financial future today with The Complete Guide to Financial Planning.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/finance.webp?alt=media&token=f3771c8a-3ff4-4b59-a5cc-1a661109fd5d"
  },
  {
    "name": "FAST AND FURIOUS FITNESS: A timeless fitness classic - one for the ages!",
    "category": "info",
    "url": "https://www.amazon.com/Audible-Fast-and-Furious-Fitness/dp/B0BXBG4HF3",
    "about": "So, I’ve finally done it! I’ve finally done what I never ever thought I would do–that being to revive the “old favorite”. In other words, dust the first fitness book I ever wrote off the shelves, and bring it back to life now!\n\nThat being the “evergreen” Fast and Furious Fitness–a book that received a tremendous reception back when I first released it in 2011–and judging from the 5000 plus fans on the Facebook page, is still going strong!\n\nAnyway, for whatever reason, and despite the positive response my first book received, I incredulously and astoundingly did not purse the idea any further. Although the intent was there, for whatever reason, I never pursued the idea. That is, until when I started Zero Excuses Fitness, that is.\n\nMark the date on your calendars, my friend–Monday October 15, 2018–and I’m starting off a new week with an old classic–a classic which has information that is still very relevant to everyone out there. If you’ve listened to Zero Excuses Fitness and enjoyed it, you’ll enjoy this as well.\n\nAnd hear me out on this one–although Zero Excuses Fitness was modeled on the Fast and Furious Fitness book, the two are NOT the same–and you’ll see what I mean when you listen to the book.\n\nFast and Furious Fitness has several routines and exercises that Zero Excuses Fitness doesn’t. Fast and Furious Fitness is a book that much like Zero Excuses Fitness, can be used by folks at all levels–especially for those of you at beginner levels, but the exercises in there will work just as well for advanced trainees as well.\n\nWhile the basic core of both the books are the same, the training philosophy differs. You’ll see a different spin on the same sort of topics throughout the entire book, and especially the 10 Commandments of Physical Success.\n\nBut now, the big question–if I’ve got Zero Excuses Fitness out there, and if it’s doing well, then why the fuss about Fast and Furious Fitness? Why resurrect it, as it were? Well, the answer to that one is simple my friend. It’s an old classic–and I love old classics. Whether it be Napoleon Hill’s Think and Grow Rich, Claude Bristol’s evergreen “The Magic of Believing” or “T.N.T.\"–the fact is that I love classics, and many of you do as well!\n\nWhat you’ll learn from this course:\n\nSolid training information emphasizing good old fashioned hard work, determination, and dedication.\nTraining programs that work–and are simple to do–and most importantly, get things done quickly.\nHow you can build loads of muscle on your calves and thighs, while at the same time building strength and endurance–all within 10 minutes or less!\nBuild a strong, functional midsection without doing a single crunch!\nDevelop brute strength throughout your entire back and upper body.\nHow to build huge forearms and develop the crushing power of an ape while your at it!\nThe one exercise that will build shoulders that have the strength of a male gorilla, and look like they are carved out of granite!\nAdvice on what sort of diet to follow for best gains.\nThe 10 commandments of any successful training regimen.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/fitness.webp?alt=media&token=3519deb9-e912-4d5f-ab0f-e073a24b0437"
  },
  {
    "name": "The Battle of Spotsylvania Court House: Cannons and Courage: The Stories Behind the American Civil War's Major Battles, Book 9 ",
    "category": "info",
    "url": "https://www.amazon.com/Battle-Spotsylvania-Court-House-American/dp/B0C9VSGYZR",
    "about": "The American Civil War stands as one of the defining moments in the history of the United States. Fought between the Northern states, known as the Union, and the Southern states, known as the Confederacy, the war was a profound struggle for the preservation of the Union and the abolition of slavery. Lasting from 1861 to 1865, it claimed the lives of over 600,000 Americans and forever altered the nation's trajectory.\n\nIn the pantheon of significant battles during the Civil War, the Battle of Spotsylvania Court House holds a special place. Taking place from May 8 to May 21, 1864, in Spotsylvania County, Virginia, this brutal engagement pitted the forces of Union General Ulysses S. Grant against Confederate General Robert E. Lee. The battle would become a turning point in the war, marked by intense fighting, tactical innovations, and a grim determination to achieve victory at any cost.\n\nThe importance of the Battle of Spotsylvania Court House cannot be understated. It was a critical juncture in the larger conflict, serving as a fulcrum upon which the fate of the nation teetered. This battle emerged as a crucible where the mettle of the opposing armies and their commanders was tested, pushing the limits of military strategy and tactics. The outcome of this struggle would reverberate through the subsequent course of events and shape the war's trajectory.\n\nThe Battle of Spotsylvania Court House was a pivotal moment in the American Civil War, signaling a shift in strategy and setting the stage for the relentless pursuit of victory by General Ulysses S. Grant. This battle, characterized by its brutality and tactical innovations, not only showcased the resolve of the Union forces but also exposed the resilience of the Confederate Army under the leadership of General Robert E. Lee. Moreover, the battle's impact extended beyond its immediate aftermath, altering the dynamics of the war and paving the way for the eventual Union triumph.\n\nThis book delves into the depths of the Battle of Spotsylvania Court House, unraveling the events that led to this significant clash and examining its consequences. It will provide a comprehensive account of the battle, shedding light on the strategies, tactics, and the sacrifices made by both sides. By exploring the struggles faced by the soldiers on the front lines, the decisions made by the commanding officers, and the societal implications of this protracted conflict, we aim to paint a vivid picture of this crucial turning point in the American Civil War.\n\nThroughout the following chapters, we will traverse the battlefields, maneuver through the trenches, and encounter the heroes and casualties of this brutal struggle. From the opening skirmishes to the decisive moments at the \"Bloody Angle,\" we will examine the intricate details of the battle, the stalemate that ensued, and the lasting consequences that reverberated across the nation.\n\nBy delving into the Battle of Spotsylvania Court House, we can gain a deeper understanding of the pivotal moments that shaped the outcome of the Civil War. This battle serves as a testament to the endurance, valor, and sacrifice exhibited by the soldiers on both sides, as well as the strategic decisions and innovations that influenced the course of the conflict.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/spotsy.jpg?alt=media&token=ca21bc5d-5f69-4d7a-ac62-77dbc9b00b30"
  },
  {
    "name": "Travel Tales: Ghost Encounters (True Travel Tales) ",
    "category": "info",
    "url": "https://www.amazon.com/Audible-Travel-Tales-Ghost-Encounters/dp/B0C471Y88F",
    "about": "Collects Michael Brein's ghostly accounts of the nearly 2,000 interviews with travelers he has met in his own travels around the world over the last four decades.\n\nAlthough the typical travel stories collected in the True Travel Tales book series are ordinarily oriented towards safety and security in travel, the very scary and spooky accounts of ghosts and hauntings and all the variations in between can and do occur to travelers. Mostly these things will not happen to you. But you never know. You'll read in the series plenty of examples of the wide variety of spirit and ghost encounters that may pop up now and again in your travels as well as your own home life. \n\nThis book, however, pauses all of this. Instead of dealing with all sorts of true accounts of close calls and great escapes in connection with all sorts of scary travel situations including chases, foiled kidnappings, attacks, roadblocks, scary places, trips from hell, borders, and police, hitchhiking, international spying, smuggling, and intrigue, being in the wrong places at the wrong times, terror attacks, bandits, Mexican standoffs, airplane crashes, accidents and mishaps, white slavery, robberies, sexual harassment and assaults and more — the series now pauses to explore the spooky world of ghosts and spirits and many of the no doubt related variations in between!\n\nInstead of reading about the dangers and mishaps of others, whereby you'll focus on and gain healthier respect for the true dangers and risks of travel and adventure... the point of this book is purely to explore a virtually little known aspect of reality. By all means, haunted places abound, and where it was heretofore a forbidden subject to bring up, it is now relatively good sport to seek out haunted establishments and even to write down your experiences in a variety of guestbooks and ledgers provided at these establishments for just that purpose.\n\nAnd make no mistake, whereas some of these stories are profoundly scary and unnerving, many are the stuff of keepsake memories and smack of efforts on the part of spirits to be recognized and even be remembered.\n\nMany of the scary accounts of travelers in this book are tales of times gone by. Many ghosts seem to be intent on making others remember them. Other ghost experiences seem to be never-ending repeating replays of cycles of discarnate entities seemingly trying to resolve conflicts of times long gone by.\n\nYes, indeed, we are often the recipients of visits from ghosts and spirits on our own home turfs. It, therefore, behooves us to think of this book as not only a compendium of ghostly visits that we seek out or experience despite ourselves in our travels, but perhaps we ought to consider the visits of ghosts and spirits as similarly traveling themselves in a way from their own alternate space-time realities which conjoin or overlap with ours in one massive Contiguous Universe?\n\nIn this Reader or compendium of ghost and spirit tales, we broaden our look at not merely what we think of as the typical shadows, spirits, or apparitions reported by so many, but also to a much broader reality of similarly related behaviors of presumably a wide variety discarnate supernatural entities that cut across in mysterious ways broad swaths of what we may typically refer to as ghost or spirit visitations and their interactions with us.\n\nSuch ghostly encounters may not ever happen expressly to you, but assuredly something strange of an apparitional manifestation will invariably happen to a friend, a neighbor, or perhaps even a relative.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/ghost.webp?alt=media&token=bd88ffce-5e2b-495d-abb8-8edd87c35fa3"
  },
  {
    "name": "What Is Sikhism?: Understanding the Punjabi Indian Religion",
    "category": "info",
    "url": "https://www.amazon.com/What-Sikhism-Understanding-Punjabi-Religion/dp/B0C9VKPT4Q",
    "about": "Sound interesting? The author thinks so too! Listen to What Is Sikhism? for an understanding of the culture and religion of Sikhism as it compares to Christianity.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/simhism.webp?alt=media&token=cc718935-dd0e-43ea-a22a-8a1fb49274cc"
  },
  {
    "name": "50 Things to Know About Finding Mr. Right: Get the Guy You Deserve (50 Things to Know about Love) ",
    "category": "info",
    "url": "https://www.amazon.com/Things-Know-About-Finding-Right/dp/B0CMYCZKDD",
    "about": "Do you find yourself sad and depressed that you have not found the right man?\n\nAre you constantly asking yourself what you are doing wrong and why someone does not love you? Instead of wanting to go to weddings do you feel so envious that you would rather stay home then celebrate in someone's joy?\n\nIf you answered yes to any of these questions, then this book is for you....\n\n50 Things to Know About Finding Mr. Right: Get the Guy You Deserve, by Amanda Walton, offers an unique approach to trying to solve the dating problems that you might have had in the past.\n\nMost books on finding Mr. Right tell you to put yourself out there, to search for him, and to try and find your one and only.\n\nAlthough there's nothing wrong with that, it is far better to work on yourself. You can become a better person and be someone that everyone wants to date. Once you make yourself into the person you have always dreamed of being you will find that your dreams of finding Mr. Right will come true, too.\n\nBased on knowledge from the world's leading experts far too many women are desperate enough to find Mr. Right that they try to make Mr. Right Now into the person of their dreams. They find themselves in unhappy relationships, with men that they are not attracted to, and with out any desire to try and make their relationship stronger.\n\nIn this audio, you'll discover the keys to finding Mr. Right. You will learn how to build yourself up so that you are the best possible person for him when he does come along.\n\nThis book will help you to take a closer look at how you see yourself, to learn to see the positives that you have, and how you can use these positives to attract the right type of man.\n\nBy the time you finish this book, you will know how to find your own Mr. Right.\n\nSo grab your copy today. You'll be glad you did.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/find-a-man.webp?alt=media&token=fc7f84ba-ce36-4ef6-b112-c410d6afa55f"
  }
]