[
  {
    "name": "Star Fall",
    "category": "TJ Reeder",
    "url": "https://www.amazon.com/Audible-Star-Fall/dp/B0CD2YZHGZ",
    "about": "Star Fall is a combination of Sci-Fi , the Old West and Survival after the remains of a huge Meteor spread over the earth. Follow the adventures of a strange mixture of adventurers called \"hunters\" who live by scavenging the remains of America ..",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/Star%20Fall.webp?alt=media&token=784b89b9-b9cd-4d14-9a6d-7d2b23cf2d46"
  },
  {
    "name": "ZOMBIES ... What if?",
    "category": "TJ Reeder",
    "url": "https://www.amazon.com/Audible-Zombies-What-If/dp/B0CK9PBC2L",
    "about": "This is a story about four young men; lifelong friends, who find themselves in a Zombie war. Being in their twenties, they all grew up on horror movies and video games. They watched every episode of The Walking Dead, and after each week's show, they spent the rest of the week tearing the show apart, covering all the 'what ifs', and 'why's' and filling it in with, \"If it was me, I woulda done ...\" So now they are in the middle of it and it's not a game. Now they have to do it for real. Can they? For my usual fans please don't stone me, I always swore I'd never write a Zombie book but I thought how much fun I could make it and so I did. It's not as gory in written form as of course Hollyweird would show it but it's hard to use the written word to convey somebody's guts being ripped out so I didn't bother. I hope you enjoy it and I expect to see a review saying yea or nea.\nYeah, I've gamed this stuff too and this is how I would do it, but I'd need some buddies watching my six.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/zombies_what_if.webp?alt=media&token=c42294b9-b451-484a-b943-46583bd60f61"
  },
  {
    "name": "Buck and Bean",
    "category": "TJ Reeder",
    "url": "https://www.amazon.com/Audible-Buck-and-Bean/dp/B0CDMP4K2Z",
    "about": "Needing a break from the Long Lonely Road series I had decided to write a stand alone and this is the results. it had the usual crash and parts of the old west and a small bit of modern day things. I like the characters and if you folks like it I might do another one. Please let me know in a review, even a one word review if fine \"Good or Bad\"..",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/Buck%20and%20Bean.webp?alt=media&token=9f9dbd3f-b263-4916-9068-001b7520a19d"
  },
  {
    "name": "Buck and Bean, The Marshals, book two",
    "category": "TJ Reeder",
    "url": "https://www.amazon.com/Marshals-Buck-Bean-Book-Two/dp/B0CF4KHV5Z",
    "about": "Life on the new frontier after the crash. A blend of the old west and a bit of the leftover times before the crash.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/The%20Marshals%20Buck%20and%20Bean%2C%20Book%20Two.webp?alt=media&token=d7104114-7129-4282-be7c-715fe4fb614e"
  },
  {
    "name": "Buck and Bean, Marshalls and Rangers, Book 3",
    "category": "TJ Reeder",
    "url": "https://www.amazon.com/Marshalls-Rangers-Buck-Bean-Book/dp/B0CFWKCH2D",
    "about": "This book was re-edited in 2023.\nLife in the old and new days, after the crash parts of the country, are living an 1880s lifestyle while others are in about the 1960s, Come along for the ride as the Baker Brothers chase outlaws as Territory Marshals.\n",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/Buck%20and%20Bean%2C%20Marshalls%20and%20Rangers%2C%20Book%203.webp?alt=media&token=03c14d97-871b-48a3-bf35-40e7b96aab6f"
  },
  {
  "name": "Buck and Bean, Double Trouble, Book 4",
  "category": "TJ Reeder",
  "url": "https://www.amazon.com/Double-Trouble-Buck-Bean-Book/dp/B0CH3ZYWRM",
  "about": "More in the life of the Baker brothers living life in the new frontier following the crash caused by several things plus a plague. They have built a new home and life in the modern old west.",
  "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/Double%20Trouble%20Buck%20and%20Bean%20Book%204.webp?alt=media&token=32bbb793-d398-4a95-9dca-b663b1d5bc05"
  },
  {
    "name": "Buck and Bean, Book 5. Bad Times Comin",
    "category": "TJ Reeder",
    "url": "https://www.amazon.com/Buck-Bean-Book-Times-Comin/dp/B0CNKZXNH2",
    "about": "Needing a break from the Long Lonely Road series I decided to write a stand alone and this is the result. it had the usual crash and parts of the old west and a small bit of modern-day things. I like the characters and if you folks like it I might do another one. Please let me know in a review, even a one-word review if fine \"Good or Bad\".. TJ\nWell, here is the proof yawl liked Buck and Bean, I'm now adding book five to the series. I really enjoy writing B&B and am planning number 6 as I speak.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/Buck5.webp?alt=media&token=dbc87c5a-f98d-4e50-8c73-fc07bc69e4a5"
  },
  {
    "name": "Jackson Slade, Book 1: The Frontiersman",
    "category": "TJ Reeder",
    "url": "https://www.amazon.com/Frontiersman-Jackson-Slade-Book/dp/B0CT949XFG",
    "about": "Jackson Slade, Confederate Soldier, Explorer, Scout and Gunfighter who thru a twist of fate will live history as it is made in the frontier of the West and beyond. For a very long time.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/JACKSON-SLADE-BOOK-1.webp?alt=media&token=d87d5d8c-44cf-41ef-ad12-c33699115232"
  },
  {
    "name": "Jackson Slade, The Drifter, Book two",
    "category": "TJ Reeder",
    "url": "https://www.amazon.com/Drifter-Jackson-Slade-Book-Two/dp/B0CVSB4ZVR",
    "about": "The life and times of Jackson Slade a civil war survivor of the Army of the Confederacy and his very long and adventure filled life after the war, from small rancher to Indian scout to western Lawman to Soldier. Slade lives a long life through all the turmoil of a nation growing too fast. His loves and life will hopefully entertain you. Enjoy.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/jackson-slade-book-2.webp?alt=media&token=166d9c52-a762-48df-b7c1-546468c4d6d3"
  },
  {
    "name": "Jackson Slade, Indian Fighter, book three",
    "category": "TJ Reeder",
    "url": "https://www.amazon.com/Jackson-Slade-Indian-Fighter-Three/dp/B0CZF9K4RR",
    "about": "The story of Jackson Slade, Soldier, Drifter, Indian fighter. Jackson's life spans many more years the it should because of an accidental discovery of a mysterious portal to another world and the further discovery of an even more mysterious cave with a glowing pool of water. Come ride with Slade as he fights, lives and loves across the many years.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/JS3jpg.webp?alt=media&token=043fc942-4d4f-45d6-9932-2b25ec9c6400"
  },
  {
    "name": "The Free Republic of Texas 2015",
    "category": "TJ Reeder",
    "url": "https://www.amazon.com/Free-Republic-Texas-2015/dp/B0CKZXZC8F",
    "about": "Two men from very different backgrounds meet in a small café in rural Texas.Together they build a refuge and a stronghold for the remnants of a fallen nation. With their neighbors, they work to build something new using the old-fashioned values and ways. The Free Republic of Texas is born.",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/The%20Free%20Republic%20of%20Texas%202015.webp?alt=media&token=9217ab82-5932-47a4-b192-ca462018197d"
  },
  {
    "name": "DOMESTIC ENEMIES",
    "category": "TJ Reeder",
    "url": "https://www.amazon.com/Audible-Domestic-Enemies/dp/B0CS4HXKKB",
    "about": "When he gets tired of seeing elected officials breaking the oath they made to the country, Jake Hunter decides to take matters into his own hands.\n\nFinding a few like-minded friends, they begin to carry out their mission. First, they use scare tactics to try to get those officials to keep the promises they made to get elected. When that doesn't make much difference, they resort to other measures. Some turning deadly.\n\nWill Jake and his friends make a difference? What about you...can you...will you make a difference when it's needed?",
    "image": "https://firebasestorage.googleapis.com/v0/b/jeff-talks.appspot.com/o/DOMESTIC-ENEMIES.webp?alt=media&token=ee3f03ab-0f1c-48ac-b859-14b61e06a5c0"
  }
]